[M_Sage_Mission03:FindVillageSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Find out what Nakayama's savages are worshipping and destroy it."
MissionDescriptionOverride="The irrelevantly nefarious Professor Nakayama finally convinced you and Hammerlock to come after him. Thanks to Nakayama's incessant whining, you once again find yourself embroiled in a bitter struggle against a Hyperion opponent.  Hammerlock has decided that, since Nakayama appears to control the local savage population, you might find some answers if you head to an area where savages tend to congregate. He's picked up some radio chatter from the other side of [place]Scylla's Grove[-place]. Apparently, the savages are worshipping... something.  Hammerlock wants you to find and destroy the subject of their worship before it can cause you problems later on."

[M_Sage_Mission03:SaveClaptrapAgainSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The irrelevantly nefarious Professor Nakayama finally convinced you and Hammerlock to come after him. Thanks to Nakayama's incessant whining, you once again find yourself embroiled in a bitter struggle against a Hyperion opponent. Hammerlock has decided that, since Nakayama appears to control the local savage population, you might find some answers if you head to an area where savages tend to congregate. He picked up some radio chatter from the other side of [place]Scylla's Grove[-place]. Apparently, the savages were worshipping... something. As it turned out, the ''something'' in question happened to be Claptrap, who evidently decided to take a vacation in one of Pandora's deadliest areas. Because he's Claptrap, he said something stupid about five seconds after you met him, and the savages tried to kill him. After saving him, he could not help but cause even more trouble. You should probably protect him. Maybe."

[M_Sage_Mission03:SaveClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The irrelevantly nefarious Professor Nakayama finally convinced you and Hammerlock to come after him. Thanks to Nakayama's incessant whining, you once again find yourself embroiled in a bitter struggle against a Hyperion opponent. Hammerlock has decided that, since Nakayama appears to control the local savage population, you might find some answers if you head to an area where savages tend to congregate. He picked up some radio chatter from the other side of [place]Scylla's Grove[-place]. Apparently, the savages were worshipping... something. As it turned out, the ''something'' in question happened to be Claptrap, who evidently decided to take a vacation in one of Pandora's deadliest areas. Because he's Claptrap, he said something stupid about five seconds after you met him, and now the savages are trying to kill him.<br><br>You should probably protect him."
